In [1]:
import pandas as pd

In [2]:
sr1 = pd.Series([10, -1, 9, 20, -3])

In [3]:
sr1

0    10
1    -1
2     9
3    20
4    -3
dtype: int64

In [4]:
type(sr1)

pandas.core.series.Series

In [5]:
sr1.values

array([10, -1,  9, 20, -3], dtype=int64)

In [6]:
sr1.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
sr2 = pd.Series([10, -1, 9, 20, -3], index=['a','b','c','d','e'])
sr2

a    10
b    -1
c     9
d    20
e    -3
dtype: int64

In [8]:
data = { 'names' : ['sunyoung','sunyoung','pyo','sunny','sunny'], 
       'year' : [2017, 2018, 2016, 2019, 2017],
        'points' : [1.5, 1.9, 2.0, 3.9, 5.5]  }

In [9]:
df = pd.DataFrame(data)

In [10]:
df

      names  year  points
0  sunyoung  2017     1.5
1  sunyoung  2018     1.9
2       pyo  2016     2.0
3     sunny  2019     3.9
4     sunny  2017     5.5

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.columns

Index(['names', 'year', 'points'], dtype='object')

In [13]:
df.values

array([['sunyoung', 2017, 1.5],
       ['sunyoung', 2018, 1.9],
       ['pyo', 2016, 2.0],
       ['sunny', 2019, 3.9],
       ['sunny', 2017, 5.5]], dtype=object)

In [14]:
df2 = pd.DataFrame(data, columns=['year','names','points', 'penalty'],
                  index=['one','two','three','four','five']) 
df2

       year     names  points penalty
one    2017  sunyoung     1.5     NaN
two    2018  sunyoung     1.9     NaN
three  2016       pyo     2.0     NaN
four   2019     sunny     3.9     NaN
five   2017     sunny     5.5     NaN

In [15]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [16]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [17]:
df2.values

array([[2017, 'sunyoung', 1.5, nan],
       [2018, 'sunyoung', 1.9, nan],
       [2016, 'pyo', 2.0, nan],
       [2019, 'sunny', 3.9, nan],
       [2017, 'sunny', 5.5, nan]], dtype=object)

In [18]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2017.400000  2.960000
std       1.140175  1.696467
min    2016.000000  1.500000
25%    2017.000000  1.900000
50%    2017.000000  2.000000
75%    2018.000000  3.900000
max    2019.000000  5.500000

In [19]:
#df2.describe?

In [20]:
import numpy as np
df2.describe(include=[np.object])

           names  penalty
count          5      0.0
unique         3      0.0
top     sunyoung      NaN
freq           2      NaN